// 1.
//* Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
// ==================================== 1 ============================
const celsiumTemperature = 20;
const farangeitTemperature = celsiumTemperature * 1.8 + 32;
console.log(`${celsiumTemperature}°C`);
console.log(`${farangeitTemperature}°F`);

// 2.
//* Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
//==================================== 2 ============================
const daysInMonth = 30;
const hourInDay = 24;
const minInHour = 60;
console.log(hourInDay * daysInMonth);
console.log(minInHour * hourInDay * daysInMonth);
// 3.
//* Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
//==================================== 3 ============================
let health = 100;
let energy = 100;
health -= 50;
energy -= 65;
console.log(health);
console.log(energy);

// 4.
//* Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
//==================================== 4 ============================
let total = 0;
const purchaseAmount = 500;
const dickont = purchaseAmount * 0.1;
total = purchaseAmount - dickont;
console.log(total);
// console.log(purchaseAmount - purchaseAmount * 0.1);

// 5.
//* Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
//==================================== 5 ============================
const num = 3.563;
console.log(Math.floor(num));

// 6.
//* Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
//==================================== 6 ============================
const string = '15.68qwerty';
console.log(parseFloat(string));
//7.
//* Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
//==================================== 7 ============================
const str = '235';
console.log(parseInt(str));

//8.
//* Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
// ==================================== 8 ============================
const numSqrt = Math.sqrt(9);
console.log(numSqrt);
//9.
//* Створити змінні для зберігання цілочисельного значення та рядка з числом
//* у вигляді рядка.Використати метод parseInt() для перетворення рядка у ціле число
//* та вивести результат в консоль.Потім використати метод toString() для перетворення
//* цілочисельного значення у рядок та вивести результат в консоль.
// ==================================== 9 ==========================
const str9 = '123';
const num9 = 159;
console.log(parseInt(str9));
console.log(num9.toString());

// const confirmUser = confirm('Ви підтверджуєте дію?');
// console.log(confirmUser);
// if (confirmUser) {
//   alert('Дякую за підтвердження!');
// } else {
//   alert('Дію відмінено!');
// }

const num2 = true;
const str2 = '123';

console.log(parseInt(str2));
console.log(num2);
console.log(num2.toString());

console.log(String(num2));

const dayPerMounth = 30;
const hourOfDay = 24;
const minutesOfHour = 60;

console.log(
  `${dayPerMounth} к-ть днів у міс * ${hourOfDay}  * ${minutesOfHour} к-ть хвилин у місяці`
);
