// Написати скрипт який буде перевіряти середній бал успішності учня.
// Прервати роботу циклу, коли середній бал буде меньше 7.
// Виведіть в консоль всі непарні числа за допомогою циклу for
// 3. Творчі завдання
// Напиши цикл, який пропонує в prompt ввести число, більше 100.
// Якщо відвідувач ввів інше число — попросити ввести ще раз и т.д.
// Напиши скрипт який підраховує загальну суму зп працівників.
// Кількість робітників зберігається в змінній employees.
// ЗП кожного працівника це випадкове число від 500 до 5000.
//  Записати суму в змінну totalSalary і вивести в на сторінку.
// Напиши скрипт який порахує суму всіх парних чисел, які входять в діапазон чисел в змінних від min до max.
// Наприклад, якщо min = 0 и max = 5, то діапазон 0 - 5, і в ньому 2 парних числа — 2 та 4, їх сума 6.
//  Можна зробити отримання значень мінімального і максимального числа через інпут.
// Цикл повинен питати число поки відвідувач не введе число, більше 100, або не натисне кнопку Відміна (ESC).
// 4. Супертворчі завдання
// Напиши скрипт, який імітує авторизацію адміністратора в панелі управління.
// Є змінна message в яку буде записано повідомлення про результат.
// При завантаженні сторінки у відвідувача запитується пароль через prompt:
// Якщо натиснули Cancel, записати в message рядок 'Скасовано користувачем!'
// В іншому випадку, якщо введений пароль який збігається зі значенням константи ADMIN_PASSWORD, записати в message рядок 'Ласкаво просимо!'
// В іншому випадку, тобто якщо жодна з попередніх умов не виконалася, записати в message рядок 'Доступ заборонений, невірний пароль!'
// Після всіх перевірок вивести в alert значення змінної message.

// На рахунку користувача є 23580 кредитів, значення зберігається в змінній credits (створи і привласни).
//  Користувач вирішує купити пазли, які коштують по 3000 кредитів за штуку.
// Ціна одного пазла зберігається в змінній pricePerPazzle(створи і привласни).
// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість пазлів, які користувач хоче купити і зберегти в змінну.
// Напиши скрипт який:
// Якщо в prompt була натиснута кнопка Cancel, виводить в консоль повідомлення 'Скасовано користувачем!'.
// В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній totalPrice.
// Перевіряє чи зможе користувач оплатити замовлення:
// 👉 якщо сума до оплати перевищує кількість кредитів на рахунку, виводь в консоль повідомлення 'Недостатньо коштів на рахунку!'.
// 👉 в іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести повідомлення 'Ви купили [число] пазлів, на рахунку залишилося [число] кредитів.'.
// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в input. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.
// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну.
// Обов'язково використовуй switch. Формат повідомлення: 'Доставка в[країна] буде коштувати[ціна] кредитів'. Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.
// Нижче наведено список країн і вартість доставки:
// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

// Напиши скрипт який просить відвідувача ввести число в prompt до тих пір, поки відвідувач не натисне Cancel і кожен раз додає введене значення до загальної суми:
// При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до значення змінної total.
// Операція введення числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення натиснувши кнопку Cancel, показати alert з рядком 'Загальна сума чисел дорівнює [сума]'.
// 🔔 Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно. Якщо хочеш, в разі некоректного введення, показуй alert з текстом 'Було написано не число, спробуйте ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого знову користувачеві пропонується ввести число в prompt.

//*   Напиши цикл, який пропонує в prompt ввести число, більше 100.
//*   Якщо відвідувач ввів інше число — попросити ввести ще раз и т.д.

//*   Напиши скрипт який підраховує загальну суму зп працівників.
//*   Кількість робітників зберігається в змінній employees.
//*   ЗП кожного працівника це випадкове число від 500 до 5000.
//*   Записати суму в змінну totalSalary і вивести в на сторінку.

//*   Напиши скрипт який порахує суму всіх парних чисел, які входять в діапазон чисел в змінних від min до max.
//*   Наприклад, якщо min = 0 и max = 5, то діапазон 0 - 5, і в ньому 2 парних числа — 2 та 4, їх сума 6.

//*   Можна зробити отримання значень мінімального і максимального числа через інпут.
//*   Цикл повинен питати число поки відвідувач не введе число, більше 100, або не натисне кнопку Відміна (ESC).

//*   Супертворчі завдання
//*   Напиши скрипт, який імітує авторизацію адміністратора в панелі управління.
//*   Є змінна message в яку буде записано повідомлення про результат.
//*   При завантаженні сторінки у відвідувача запитується пароль через prompt:
//*   Якщо натиснули Cancel, записати в message рядок 'Скасовано користувачем!'
//*   В іншому випадку, якщо введений пароль який збігається зі значенням константи ADMIN_PASSWORD, записати в message рядок 'Ласкаво просимо!'
//*   В іншому випадку, тобто якщо жодна з попередніх умов не виконалася, записати в message рядок 'Доступ заборонений, невірний пароль!'
//*   Після всіх перевірок вивести в alert значення змінної message.

// let ii = 0;

// while (ii <= 20) {
//   ii += 5;
//   console.log('ii =>', ii);
// }

// =============================
// let total = 0;

// for (let i = 0; i <= 20; i += 1) {
//   console.log('i =>', i);
//   total += i;
// }
// console.log('total:>>', total);

// =========================================

// const target = 5;
// let total = 0;

// for (let i = 0; i <= target; i += 1) {
//   console.log('i =>', i);
//   total += i;
// }
// console.log('total:>>', total);

// ===========================================

// const max = 10;
// for (let i = 0; i < max; i += 1) {
//   console.log(`${max} % ${i} = `, max % i);
// }

// for (let i = 1; i <= 10; i += 1) {
//   console.log('i:>>', i);
//   if (i === 5) {
//     console.log('число =>', i);
//     // break;
//   }
// }

// for (let i = 0; i <= 10; i += 1) {
//   // console.log('i:>>', i);
//   if (i % 2 === 0) {
//     // console.log('парні число  =>', i);
//     continue;
//   }
//   console.log('не парні число:>>', i);
// }

//*   Напиши цикл, який пропонує в prompt ввести число, більше 100.
//*   Якщо відвідувач ввів інше число — попросити ввести ще раз и т.д.

// let num;
// do {
//   let userInput = parseInt(prompt('Введіть число більше 100'));
//   num = userInput;
// } while (isNaN(num) || parseInt(num) <= 100);

// alert('Дякуємо! Ви ввели число більше 100');

// Створити масив з числами від 1 до 5.
//  Вивести на екран кожен елемент масиву за допомогою циклу while.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
const arrayStr = ['Jony', 'Alla', 'Victor', 'Adriy', 'Sergiy', 'c', 'r', 'i', 'p', 't'];

// console.log('array:>>', array.length);
// console.log('array:>>', array[0]);
// console.log('array:>>', array[7]);
// console.log('array:>>', array[array.length - 2]);

//* while
// let index = 0;
// while (0 < 10) {}
// while (index < array.length) {
//   if (index === 7) {
//     index += 1;
//     break;
//   }
//   console.log('el:>>', array[index]);
// }

// //* for
// for (let index = 0; index < arrayStr.length; index += 1) {
//   if (index === 5) {
//     break;
//   }
//   console.log('el:>>', arrayStr[index]);
// }

// for (let index = 0; index < array.length; index++) {
//   const element = array[index];
// }
